{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "7511bce6",
   "metadata": {},
   "source": [
    "### Задача 1. Использование условного оператора if\n",
    "\n",
    "Даны три целых числа X,Y,Z, записанных в строку через пробел. Необходимо определить, существует ли треугольник с такими длинами сторон и, если существует, будет ли он прямоугольным.\n",
    "\n",
    "Возможные варианты вывода программы: \"no\" (треугольник не существует), \"yes-yes\" (треугольник существует и он прямоугольный), \"yes-no\" (треугольник существует, но он не является прямоугольным).\n",
    "\n",
    "**Sample Input:**\n",
    "\n",
    "3 4 5\n",
    "\n",
    "**Sample Output:**\n",
    "\n",
    "yes-yes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "0998987a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 4 5\n",
      "yes-yes\n"
     ]
    }
   ],
   "source": [
    "x, y, z = map(int, input().split())\n",
    "if x + y > z and z + y > x and x + z > y:\n",
    "    if x**2 + y**2 == z**2 or z**2 + y**2 == x**2 or x**2 + z**2 == y**2:\n",
    "        print(\"yes-yes\")\n",
    "    else:\n",
    "        print(\"yes-no\")\n",
    "else:\n",
    "    print(\"no\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "690bf606",
   "metadata": {},
   "source": [
    "### Задача 2. Использование условного оператора if\n",
    "\n",
    "Михаил работает в ботаническом саду - ухаживает за растениями. В назначенный день в сад привезли M литров жидкого удобрения, но новый поставщик поменял условия доставки: теперь нужно сразу же переливать удобрение в свои ёмкости, а тару возвращать курьеру. В спешке Михаил нашёл две ёмкости: кубическую с ребром A метров и цилиндрическую c высотой H метров и радиусом основания R метров. Помогите Михаилу быстро определить, в какую ёмкость поместится удобрение.\n",
    "\n",
    "На вход программе подаются 4 вещественных числа: M,A,H,R через пробел.\n",
    "\n",
    "Необходимо вывести на экран: cube, если удобрение целиком поместится в кубическую ёмкость (а в цилиндрическую не поместится); cylinder, если удобрение целиком поместится в цилиндрическую ёмкость (а в кубическую не поместится); cube-or-cylinder, если удобрение поместится как в кубическую, так и в цилиндрическую ёмкости; cube-and-cylinder, если удобрение не помещается целиком ни в одну из ёмкостей, но может быть разлито сразу по двум ёмкостям; fail, если этих ёмкостей не достаточно, чтобы целиком разлить удобрение.\n",
    "\n",
    "**Sample Input:**\n",
    "\n",
    "1000 0.5 1 0.7\n",
    "\n",
    "**Sample Output:**\n",
    "\n",
    "cylinder"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "314e7207",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1000 0.5 1 0.7\n",
      "cylinder\n"
     ]
    }
   ],
   "source": [
    "m , a, h, r = map(float, input().split())\n",
    "m = m / 1000\n",
    "cube_v = a ** 3\n",
    "cylinder_v = 3.14 * (r**2) * h\n",
    "if cube_v >= m and cylinder_v < m:\n",
    "    print(\"cube\")\n",
    "elif cube_v < m and cylinder_v >= m:\n",
    "    print(\"cylinder\")\n",
    "elif cube_v >= m and cylinder_v >= m:\n",
    "    print(\"cube-or-cylinder\")\n",
    "elif cube_v + cylinder_v >= m:\n",
    "    print(\"cube-and-cylinder\")\n",
    "elif cube_v + cylinder_v < m:\n",
    "    print(\"fail\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4adb0f54",
   "metadata": {},
   "source": [
    "### Задача 3. Использование цикла while\n",
    "\n",
    "В клинике «Семейная клиника» проводится акция на УЗИ беременных женщин. Стажёру Анне поручено позвонить всем беременным женщинам, наблюдающимся в клинике, и сообщить об акции. Так как число пациентов клиники N может быть очень большим, необходимо помочь Анне автоматизировать процесс выбора беременных женщин среди всех пациентов.\n",
    "\n",
    "На вход программе подаются следующие входные данные: в первой строке - число N всех пациентов клиники, далее идёт ровно N строк, содержащих следующую информацию через пробел - порядковый номер пациента (1, 2, 3,...), его пол (M - мужчины, F - женщины) и наличие беременности (1 - беременна, 0 - не беременна).\n",
    "\n",
    "Программа должна вывести через запятую порядковые номера всех беременных женщин. Если беременных нет, то вывести 0.\n",
    "\n",
    "**Sample Input:**\n",
    "\n",
    "5\n",
    "\n",
    "1 F 1\n",
    "\n",
    "2 M 0\n",
    "\n",
    "3 F 0\n",
    "\n",
    "4 M 0\n",
    "\n",
    "5 F 1\n",
    "\n",
    "**Sample Output:**\n",
    "\n",
    "1,5"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "015bcf60",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5\n",
      "1 F 1\n",
      "2 M 0\n",
      "3 F 0\n",
      "4 M 0\n",
      "5 F 1\n",
      "1,5\n"
     ]
    }
   ],
   "source": [
    "N = int(input())\n",
    "i = 0\n",
    "lst = []\n",
    "while i != N:\n",
    "    p = list(input().split(\" \"))\n",
    "    if p[-1] == \"1\":\n",
    "        i += 1\n",
    "        lst.append(p[0]) \n",
    "    else: \n",
    "        i+=1        \n",
    "while lst == []:\n",
    "    lst.append(\"0\")\n",
    "    break\n",
    "print(*lst, sep = \",\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0023bbd7",
   "metadata": {},
   "source": [
    "### Задача 4. Использование цикла for\n",
    "\n",
    "Хорошо известно, что в производственной лаборатории должны контролироваться температура и относительная влажность воздуха. Для измерения климатических параметров лаборатории часто используются термогигрометры, а результаты измерений заносятся в специальный журнал. Обычно температура в лаборатории колеблется от 15 до 27 градусов, а влажность воздуха изменяется от 15 до 75 процентов. Необходимо на основании всех сделанных за день записей определить среднесуточную температуру и среднесуточную влажность воздуха в лаборатории. В течение каждого дня может быть сделано разное количество записей, но всегда есть хотя бы одна запись температуры и хотя бы одна запись влажности.\n",
    "\n",
    "На вход программе через пробел подаются зарегистрированные записи климатических измерений. Пример записи температуры: t=21C, влажности: h=52%. Все значения температур и влажностей заранее округлены до целых значений.\n",
    "\n",
    "Необходимо вычислить среднесуточную температуру N и среднесуточную влажность воздуха M и вывести результат в формате T=N;H=M (без пробелов).\n",
    "\n",
    "**Sample Input:**\n",
    "\n",
    "t=21C t=22C h=52% t=18C t=19C h=60% h=60% t=17C h=56%\n",
    "\n",
    "**Sample Output:**\n",
    "\n",
    "T=19.4;H=57.0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "127e4fde",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "t=21C t=22C h=52% t=18C t=19C h=60% h=60% t=17C h=56%\n",
      "T=19.4;H=57.0\n"
     ]
    }
   ],
   "source": [
    "lst = list(input().split(\" \"))\n",
    "N = []\n",
    "M = []\n",
    "for i in lst:\n",
    "    if i[0] == \"t\":\n",
    "           N.append(int(i[2:4]))\n",
    "    elif i[0] == \"h\":\n",
    "           M.append(int(i[2:4]))\n",
    "n = sum(N) / len(N)\n",
    "m = sum(M) / len(M)\n",
    "print(f\"T={n};H={m}\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
